app/controllers/images_controller.rb

  def create
    @image = Image.create(image_params)
    @image.tags_attributes = params[:tags_attributes]
    @image.save
---
INSERT INTO "images" ("url", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["tag_name", "band"], ["created_at", "2017-06-08 15:52:58.530918"], ["updated_at", "2017-06-08 15:52:58.530918"]]
UPDATE "tags" SET "image_id" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["image_id", 5], ["updated_at", "2017-06-08 15:52:58.841719"], ["id", 3]]

  def update
    @image.update(image_params)
---
UPDATE "images" SET "votecount" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["votecount", 1], ["updated_at", "2017-06-22 13:30:45.183288"], ["id", 1]]

    def load_image
      @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]